[
  {
    "path": "posts/2022-04-16-field-study-and-information/",
    "title": "Diverting Our Attention To Information Practices",
    "description": "Going out into the world to understand information organization practices and cultures.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-16",
    "categories": [],
    "contents": "\nGroup Members Geroge, Yahui and Oliver\nField Study interviews\nMasters Graduate admissions officer Jennifer Duggan\nINF315: Information Practice in Organizations\nlessons learned\n\n\n\n",
    "preview": {},
    "last_modified": "2022-04-16T23:50:27-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-16-roaming-the-museum/",
    "title": "What Do We Talk About, When We Talk About Museums?",
    "description": "Museums are places of wonder and awe. But the experiences gathered from each person is solely unique.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-16",
    "categories": [],
    "contents": "\n\nIn any society, we are bound by certain norms that dictate how we\nought to behave in the presence of others. When you want to watch a\nmovie in the theatres, you have to abide by the unspoken rule of not\nspeaking because you and everyone else is there to enjoy the movie. When\nwatching a sports game, people go with the sole purpose of seeing\nprofessionals what they do best and to experience the game first hand.\nSome roam through the isles in a grocery store to figure out what they\nneed to purchase, but the grocery store itself is a meeting place to get\nfood. So now the question is, why do museums mediate the experience\nof visitors? A short answer is that museums collect the memories of\nmany but present them to a broader scope of people to satisfy their\nindividual needs.\nMuseums generally take up lots of space within the cities they occupy\nand require special attention for the objects, performances and\nconversations it shelters from the elements of mother nature. Although\nin our minds, Museums accomplish many things for some, they can finally\nput an image to how we imagine “true beauty” to look like. Museums can\nconvey power the particular country has by conquering its’ enemies\nprized possessions; museums can also remind us about those who lived on\nearth many millennia before I am here today writing this blog post.\nHowever, not only the objects or performances within the many rooms can\ninvoke these thoughts; that is only half of the battle. The other half\nof the battle comes from the professionals who run the museum to ensure\nit operates to its prestigious glory. From the conservationists to the\ncurators, every employee within the museum has a role to play.\nImagine the first time you were at a museum. You walk through the\ndoors and are immediately blown away by the sheer amount of objects,\nfrom “ordinary” spoons to dinosaur bones. But you do a mini shuffle in a\ndirected path meticulously charted out by the museum director/curator,\nand you just follow the person in front of you. For a moment, you pause\nat a painting of a person that you feel is just watching you as you\nmove. You then feel a sudden chill and think to yourself: “Those eyes\nare very creepy. I think they are following me.” As a member of the\nmuseum, you are now participating just like everyone else in the room,\nforming your own thoughts and feelings after interacting with the\npainting. And as you get older, you look back at that first moment\nthinking about the painting. This curiously/desire to learn more is the\nreason why you find yourself back in that exact spot having a\ntête-à-tête(a private conversation) with the painting yet again with the\nhope to get something different the next time the two of you meet.\n\n\n\n",
    "preview": "posts/2022-04-16-roaming-the-museum/Modigliani_portrait.jpeg",
    "last_modified": "2022-04-16T23:14:59-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-16-webscrapping-indian-prime-ministers/",
    "title": "Standing On the Shoulders Of Prime Ministers",
    "description": "Learning how about webscrapping and applying lessons learned through R.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-16",
    "categories": [],
    "contents": "\nThere are many ways to collect data, from the people we interact with\nto the websites we create. What is quite interesting about the data out\nin the world is that it is in front of our faces, but we choose what we\nwould like to investigate or, in my case, to learn more about. Then\ntaking said data and giving it some context transform data into\ninformation, but this information you see or hear can be altered into\nknowledge. Knowledge is what we as people within society try to use the\ninformation gathered. After learning about this new way of gathering\ndata, turning said data into information, and then presenting my\ninformation as knowledge on a particular subject, I decided to look at\nthe list of Indian Prime Ministers from Wikipedia.\nThe purpose of this journey was to learn how to web scrape, following\nthe example from my professor: Rohan Alexander’s book {Telling\nStories with Data](https://www.tellingstorieswithdata.com/gather-data.html#web-scraping).\nI can say I have lots to learn, but happy with the result of the work\nproduced. To see the final results check out: Standing On the Shoulders Of\nPrime Ministers\n\n\n\n",
    "preview": "posts/2022-04-16-webscrapping-indian-prime-ministers/Primeminister.png",
    "last_modified": "2022-04-16T22:58:25-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-13-popularization-science/",
    "title": "Putting Science and Technology On Display",
    "description": "The bridge between science and the public.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-13",
    "categories": [],
    "contents": "\nThe popularization of science and technology is a fascinating topic.\nI learned about this topic in INF302: Integrative Approaches to\nScience & Technology. The definition of popularization is the\nidea of sharing and describing a complex idea among people who are not\nin the same field as you or do not have the same educational background\nas you puts the importance of communication into perspective. In one of\nthe assignments I had to complete for this class, I had decided to\ncritically analyze the chapters On the Public Understanding of\nScience and Expertise and Public Participation in Sergio Sismondo’s\nbook: An Introduction to Science and Technology Studies. The\nanalysis involved me taking these two chapters, synthesizing them, and\ndeveloping future steps of how we can begin to look at the\npopularization of science and technology. The popularization of science\nand technology resonates for me because communication and creating a\ndialogue around the objects/systems we interact with involves multiple\npoints of view and understandings to genuinely grasp what we see and\nuse. Thanks to this class, I can see the intersection of science and\ntechnology meet people. As it is the people who rely on this information\nand these technologies to navigate the real world.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-04-16T19:53:44-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-13-understanding-the-black-box/",
    "title": "Understanding The Black Box",
    "description": "Sometimes what is important is to look within the Black Box and ask questions.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-13",
    "categories": [],
    "contents": "\nHaving no experience in Computer Science and Computational Thinking,\nI thought I was out of my element in the class INF313: Intro to\nComputational Thinking. However, being at the halfway point in the\ncourse, I have realized that computational thinking has more facets to\nlife in general, that does not strictly mean it is bound within a\ncomputer. I was able to see and use the ideas learned in the class, like\nstep wise refinement, taking a highly complex problem (abstraction) and\ntrying to see if I can break it down (decompose it) into more minor,\nmore manageable problems. As I continue my journey in this course, I\nbegin to have a greater appreciation of the many intricate parts that go\ninto a computer itself that I would not have given a thought to. For\nexample, computers rely on boolean algebra to take specific inputs and\nproduce outputs that the user understands. But navigating around these\n1’s and 0’s is a lot like the same functions we do today with language\nwhen describing when we use “and,” “or” and “not” in our language. Those\nwords can dictate an outcome of a particular situation.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-04-16T19:53:44-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-12-finding-my-footing-under-the-spotlight/",
    "title": "The Show Must Go On",
    "description": "Coming to terms with how I present yourself.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-12",
    "categories": [],
    "contents": "\nBeing fascinated by stories, one of the more difficult things is\ncapturing my narrative. It is one thing to describe someone else,\nwhether fictional or real life. However, it is easy to pick up on things\nand relate them to the experiences you have faced and somehow connect\nthem to the real world. For example, in the course INF401: Practicum\nPrep. The goal for the personal narrative assignment is to give me\nthe best tools I have at my disposal to present myself in front of a\npotential employer to fulfill my required minimum of 100 hours summer\nplacement. Having the opportunity to dig deep within myself to capture\nmy story was a cathartic experience because depending on how I described\nmyself, through the experiences I have made, I can begin to see the\ncapabilities I have. When writing the assignment, I could not help but\nthink of being in the real world engaging with many people, and things\nare almost like one whole big performance. Sometimes I may present\nmyself as an undergraduate with untapped potential when going into a\nfield I do not have much experience in but am willing to learn. Other\ntimes I may be a bit more knowledgeable with what I am being required to\ndo, so I have to play the role of the leader, trying to help guide peers\nwith a point of confusion they may face with a specific assignment. The\npoint here is that one has to be aware of the different appearances when\nout in the real world as it can be beneficial to getting that job you\nwant.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-04-16T19:53:44-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-12-fun-with-the-arduino/",
    "title": "Education Re-programmed",
    "description": "Building a collaboarative computer.",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-12",
    "categories": [],
    "contents": "\nThe DI Design group consisted of Marco C., Chyna H. Zoie S., Yahui Z.\nand Elizabeth T. We had the prompt of building a collaborative computer\nin the class INF351: How to Build a Computer and Why?. A\ncollaborative computer is defined as a computer that involves more than\none user at a time. We noticed that sometimes kids are just told what\nthey should know, and on tests, they have to recite what they remember.\nHowever, this way of learning is inefficient in the classroom because\nthis does not prepare the child for the real world, by just memorizing\nfacts will not prepare the student for what is to come. The DI design\ngroup had created a computer (the image above) using an Arduino and the\nLCD to remedy this. We can now make learning more engaging and impact\nfor the student. So they can learn from their peers and other stimuli\nlike the display to get feedback and improve their learning. This\nintroduction of a computerized flash-card quiz game tries to incorporate\nthe computer into education and point to a new way learning can be\nincorporated into a classroom with the help of a computer. This prompt\ntaught me how computers could have multiple applications and be used as\nan object of enjoyment instead of completing a specific task.\n\n\n\n",
    "preview": "posts/2022-04-12-fun-with-the-arduino/Arduino1_c.jpg",
    "last_modified": "2022-04-16T22:48:52-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-12-information-culture-playlist/",
    "title": "Navigating The Labyrinth that is 'The Computer'",
    "description": "An information culture playlist. Connecting Borges to 'The Computer'",
    "author": [
      {
        "name": "Nicholas Bosco",
        "url": {}
      }
    ],
    "date": "2022-04-12",
    "categories": [],
    "contents": "\nFor my final project in INF311: Information in the Cultural\nImagination, I took it upon myself to create an Information Culture\nPlaylist that included 3-4 pieces of media ranging from movies to\nstories to ads and anything in between. I choose to talk about a\nplaylist that revolves around three short stories of Jorge Luis Borges.\nThese short stories are in his translated anthology of selected short\nstories: The Labyrinths to describe computing as a technology\nand a practice. By critically analyzing his three works: “Pierre Menard:\nAuthor of the Quixote”, “Funes the Memorious,” and “The Library\nof Babel,” I try to propose what Borges would say to the idea of “The\nComputer.” In “Pierre Menard: Author of the Quixote”, Borges\ntries to draw out the way we interpret words and if they change meanings\nif someone/thing else had said them. In “Funes the Memorious,” Borges\nwrites about a man who remembers every little detail but cannot see the\nbigger picture. Finally, we get to “The Library of Babel,” a place where\nit is possible to have access to the world’s information. As I rely on\nBorges’ words, the connection would not have been possible if it were\nnot for my exposure to this class and the BI program as a whole.\nRegarding Borges and his writing, his stories try to tackle heavy themes\nlike memory, information and imagination, all of which are themes that\nstudents like myself try to navigate. The big question to come out of\nthis paper I hope to dive into as I continue my journey in the BI\nprogram is whether there are more connections between computing and\nliterature. More specifically, as our understanding of technologies\nchange, does it affect how we interpret other aspects of our lives?\n\n\n\n",
    "preview": "posts/2022-04-12-information-culture-playlist/compmicrolab.jpeg",
    "last_modified": "2022-04-16T19:53:44-04:00",
    "input_file": {}
  }
]
